# Day03_pandas_processing
<font size=5><b>Pandas 활용한 전처리<b></font>
<div align='right'>류 회 성(Hoe Sung Ryu)</div>

 
 
   

    
    
![](https://img1.daumcdn.net/thumb/R800x0/?scode=mtistory2&fname=https%3A%2F%2Ft1.daumcdn.net%2Fcfile%2Ftistory%2F99298F365B1A19AF0A)

    
    
---

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#판다스-데이터" data-toc-modified-id="판다스-데이터-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>판다스 데이터</a></span></li><li><span><a href="#데이터-프레임-만들기" data-toc-modified-id="데이터-프레임-만들기-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>데이터 프레임 만들기</a></span></li><li><span><a href="#데이터-프레임-결합하기" data-toc-modified-id="데이터-프레임-결합하기-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>데이터 프레임 결합하기</a></span></li><li><span><a href="#행/열-추가" data-toc-modified-id="행/열-추가-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>행/열 추가</a></span><ul class="toc-item"><li><span><a href="#행추가" data-toc-modified-id="행추가-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>행추가</a></span></li><li><span><a href="#열추가" data-toc-modified-id="열추가-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>열추가</a></span></li></ul></li><li><span><a href="#삭제" data-toc-modified-id="삭제-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>삭제</a></span><ul class="toc-item"><li><span><a href="#행삭제" data-toc-modified-id="행삭제-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>행삭제</a></span></li><li><span><a href="#열삭제" data-toc-modified-id="열삭제-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>열삭제</a></span></li></ul></li><li><span><a href="#데이터-확인" data-toc-modified-id="데이터-확인-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>데이터 확인</a></span></li><li><span><a href="#데이터-기초정보-확인" data-toc-modified-id="데이터-기초정보-확인-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>데이터 기초정보 확인</a></span></li><li><span><a href="#결측치-처리" data-toc-modified-id="결측치-처리-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>결측치 처리</a></span><ul class="toc-item"><li><span><a href="#결측치-확인" data-toc-modified-id="결측치-확인-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>결측치 확인</a></span></li><li><span><a href="#결측치-삭제" data-toc-modified-id="결측치-삭제-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>결측치 삭제</a></span></li><li><span><a href="#결측치-채우기" data-toc-modified-id="결측치-채우기-8.3"><span class="toc-item-num">8.3&nbsp;&nbsp;</span>결측치 채우기</a></span></li></ul></li><li><span><a href="#데이터-인코딩" data-toc-modified-id="데이터-인코딩-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>데이터 인코딩</a></span><ul class="toc-item"><li><span><a href="#Pandas를-map-함수" data-toc-modified-id="Pandas를-map-함수-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span><strong>Pandas</strong>를 <strong>map</strong> 함수</a></span></li><li><span><a href="#Scikit-learn-의-패키지-LabelEncoder" data-toc-modified-id="Scikit-learn-의-패키지-LabelEncoder-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span><strong>Scikit-learn</strong> 의 패키지 LabelEncoder</a></span></li></ul></li></ul></div>

## 판다스 데이터 
<img src=https://wikidocs.net/images/page/75020/dataframe_1.png width=60%>

## 데이터 프레임 만들기

In [1]:
# import
import pandas as pd

arr1 = [[0, 1, 2],
        [3, 4, 5],
        [6, 7, 8]]

arr2 = [[0,  1,  2],
        [3,  4,  5],
        [6,  7,  8],
        [9, 10, 11]]


df1 = pd.DataFrame(arr1, columns = list('bcd') )
df2 = pd.DataFrame(arr2, columns = list('bde'))

In [2]:
df1

   b  c  d
0  0  1  2
1  3  4  5
2  6  7  8

In [3]:
df2

   b   d   e
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

## 데이터 프레임 결합하기

In [4]:
# merge outer 
df = pd.merge(df1,df2,how='outer')
df

   b    c   d     e
0  0  1.0   2   NaN
1  3  4.0   5   NaN
2  6  7.0   8   NaN
3  0  NaN   1   2.0
4  3  NaN   4   5.0
5  6  NaN   7   8.0
6  9  NaN  10  11.0

In [5]:
pd.concat([df1,df2],axis=1)

     b    c    d  b   d   e
0  0.0  1.0  2.0  0   1   2
1  3.0  4.0  5.0  3   4   5
2  6.0  7.0  8.0  6   7   8
3  NaN  NaN  NaN  9  10  11

## 행/열 추가
### 행추가

In [6]:
df

   b    c   d     e
0  0  1.0   2   NaN
1  3  4.0   5   NaN
2  6  7.0   8   NaN
3  0  NaN   1   2.0
4  3  NaN   4   5.0
5  6  NaN   7   8.0
6  9  NaN  10  11.0

In [7]:
# 행추가, 열추가 
df['a'] = ['가','나','다','라','마','바','사']
df

   b    c   d     e  a
0  0  1.0   2   NaN  가
1  3  4.0   5   NaN  나
2  6  7.0   8   NaN  다
3  0  NaN   1   2.0  라
4  3  NaN   4   5.0  마
5  6  NaN   7   8.0  바
6  9  NaN  10  11.0  사

### 열추가
- list와 같이 .append()로 추가할 수 있습니다

In [8]:
a = list()
a.append('a')
print(a)

['a']

In [9]:
row_add=[{'a':1,'b':2,'c':3,'d':4,'e':5}]

df.append(row_add, ignore_index=True)

   b    c   d     e  a
0  0  1.0   2   NaN  가
1  3  4.0   5   NaN  나
2  6  7.0   8   NaN  다
3  0  NaN   1   2.0  라
4  3  NaN   4   5.0  마
5  6  NaN   7   8.0  바
6  9  NaN  10  11.0  사
7  2  3.0   4   5.0  1

In [10]:
df

   b    c   d     e  a
0  0  1.0   2   NaN  가
1  3  4.0   5   NaN  나
2  6  7.0   8   NaN  다
3  0  NaN   1   2.0  라
4  3  NaN   4   5.0  마
5  6  NaN   7   8.0  바
6  9  NaN  10  11.0  사

In [11]:
# 저장
df = df.append(row_add, ignore_index=True)

In [12]:
df

   b    c   d     e  a
0  0  1.0   2   NaN  가
1  3  4.0   5   NaN  나
2  6  7.0   8   NaN  다
3  0  NaN   1   2.0  라
4  3  NaN   4   5.0  마
5  6  NaN   7   8.0  바
6  9  NaN  10  11.0  사
7  2  3.0   4   5.0  1

## 삭제 
### 행삭제

In [13]:
# 행: axis=0
df.drop([6],axis=0)

   b    c  d    e  a
0  0  1.0  2  NaN  가
1  3  4.0  5  NaN  나
2  6  7.0  8  NaN  다
3  0  NaN  1  2.0  라
4  3  NaN  4  5.0  마
5  6  NaN  7  8.0  바
7  2  3.0  4  5.0  1

### 열삭제

In [14]:
# 열: axis=1
df.drop(['b'],axis=1)

     c   d     e  a
0  1.0   2   NaN  가
1  4.0   5   NaN  나
2  7.0   8   NaN  다
3  NaN   1   2.0  라
4  NaN   4   5.0  마
5  NaN   7   8.0  바
6  NaN  10  11.0  사
7  3.0   4   5.0  1

In [15]:
df.drop(['b','d'],axis=1)

     c     e  a
0  1.0   NaN  가
1  4.0   NaN  나
2  7.0   NaN  다
3  NaN   2.0  라
4  NaN   5.0  마
5  NaN   8.0  바
6  NaN  11.0  사
7  3.0   5.0  1

## 데이터 확인

In [16]:
df.head()

   b    c  d    e  a
0  0  1.0  2  NaN  가
1  3  4.0  5  NaN  나
2  6  7.0  8  NaN  다
3  0  NaN  1  2.0  라
4  3  NaN  4  5.0  마

In [17]:
df.tail()

   b    c   d     e  a
3  0  NaN   1   2.0  라
4  3  NaN   4   5.0  마
5  6  NaN   7   8.0  바
6  9  NaN  10  11.0  사
7  2  3.0   4   5.0  1

In [18]:
df.sample()

   b   c  d    e  a
3  0 NaN  1  2.0  라

## 데이터 기초정보 확인

In [20]:
df

   b    c   d     e  a
0  0  1.0   2   NaN  가
1  3  4.0   5   NaN  나
2  6  7.0   8   NaN  다
3  0  NaN   1   2.0  라
4  3  NaN   4   5.0  마
5  6  NaN   7   8.0  바
6  9  NaN  10  11.0  사
7  2  3.0   4   5.0  1

In [19]:
print('형태: ', df.shape)
print('차원:', df.ndim)
print('총 원소의 갯수:', df.size)

형태:  (8, 5)
차원: 2
총 원소의 갯수: 40

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   b       7 non-null      int64
 1   c       3 non-null      float64
 2   d       7 non-null      int64
 3   e       4 non-null      float64
 4   a       7 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 656.0+ bytes

In [21]:
# 기초 통계량 
df.describe()

              b     c          d          e
count  8.000000  4.00   8.000000   5.000000
mean   3.625000  3.75   5.125000   6.200000
std    3.159453  2.50   3.044316   3.420526
min    0.000000  1.00   1.000000   2.000000
25%    1.500000  2.50   3.500000   5.000000
50%    3.000000  3.50   4.500000   5.000000
75%    6.000000  4.75   7.250000   8.000000
max    9.000000  7.00  10.000000  11.000000

## 결측치 처리

결측값(NaN)가 있을 경우 머신러닝 모델을 작동 시킬 수 없음

### 결측치 확인 
 - `isna()`
 - True 는 결측값(NaN) // False는 데이터 값이 존재함을 나타냄

In [22]:
df.isna()

       b      c      d      e      a
0  False  False  False   True  False
1  False  False  False   True  False
2  False  False  False   True  False
3  False   True  False  False  False
4  False   True  False  False  False
5  False   True  False  False  False
6  False   True  False  False  False
7  False  False  False  False  False

In [23]:
df.isna().sum()

b    0
c    4
d    0
e    3
a    0
dtype: int64

### 결측치 삭제

In [24]:
df.dropna()

   b    c  d    e  a
7  2  3.0  4  5.0  1

### 결측치 채우기

In [25]:
df

   b    c   d     e  a
0  0  1.0   2   NaN  가
1  3  4.0   5   NaN  나
2  6  7.0   8   NaN  다
3  0  NaN   1   2.0  라
4  3  NaN   4   5.0  마
5  6  NaN   7   8.0  바
6  9  NaN  10  11.0  사
7  2  3.0   4   5.0  1

In [26]:
df.fillna(0)

   b    c   d     e  a
0  0  1.0   2   0.0  가
1  3  4.0   5   0.0  나
2  6  7.0   8   0.0  다
3  0  0.0   1   2.0  라
4  3  0.0   4   5.0  마
5  6  0.0   7   8.0  바
6  9  0.0  10  11.0  사
7  2  3.0   4   5.0  1

In [27]:
df.fillna(df.mean(axis=0))

   b     c   d     e  a
0  0  1.00   2   6.2  가
1  3  4.00   5   6.2  나
2  6  7.00   8   6.2  다
3  0  3.75   1   2.0  라
4  3  3.75   4   5.0  마
5  6  3.75   7   8.0  바
6  9  3.75  10  11.0  사
7  2  3.00   4   5.0  1

## 데이터 인코딩
### **Pandas**를 **map** 함수 

`map` 함수를 이용하여,데이터를 인코딩하는 방법 
> - `.map({dictioinary 이용})`

In [29]:
import seaborn as sns 
tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [30]:
tips['sex'].unique()

['Female', 'Male']
Categories (2, object): ['Female', 'Male']

In [31]:
tips['sex'].map({'Female': 1,
                 'Male': 0
                 })

0      1
1      0
2      0
3      0
4      1
      ..
239    0
240    1
241    0
242    0
243    1
Name: sex, Length: 244, dtype: category
Categories (2, int64): [0, 1]

In [32]:
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [52]:
tips['sex'] = tips['sex'].map({'Female': 0,
                               'Male': 1
                               })

### **Scikit-learn** 의 패키지 LabelEncoder 
 
feature 내 카테고리 개수가 너무 많은 경우 사용하는 방법     
> - `.unique()` 중복되지 않는 값의 '개수'
> - `.nunique()` 중복되지 않는 값을 '모두 나열'

In [33]:
import seaborn as sns

iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [34]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [35]:
from sklearn.preprocessing import LabelEncoder  # sklean에서 preprocessing모듈 속에 labelencoder 함수를 사용

le = LabelEncoder()# 사용할 함수를 정의
encoded = le.fit_transform(iris['species']) # 인코딩을 하겠다(fit_transform) // iris['species']
encoded

array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
       1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
       2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2])

In [36]:
iris['species'] = encoded
iris.head()

   sepal_length  sepal_width  petal_length  petal_width  species
0           5.1          3.5           1.4          0.2        0
1           4.9          3.0           1.4          0.2        0
2           4.7          3.2           1.3          0.2        0
3           4.6          3.1           1.5          0.2        0
4           5.0          3.6           1.4          0.2        0